In [1]:
import pandas as pd

In [3]:
# series 하나는 column이다. series 여려개가 dataframe
#행을 가르키는 번호를 index라고 하고 디폴트로 0부터 시작해서 값이 매겨진다. 수정도 가능
#dataframe에서는 column(열)도 필요하게된다
#CRUD 필요
seriesData = pd.Series([70, 60, 90])
seriesData

0    70
1    60
2    90
dtype: int64

In [14]:
#C
seriesData = pd.Series([70, 60, 90])
seriesData

0    70
1    60
2    90
dtype: int64

In [5]:
#R U
#인덱스 수정
seriesData.index

Index(['국어', '수학', '영어'], dtype='object')

In [6]:
seriesData.index = ['미술', '음악', '체육']

In [7]:
seriesData

미술    70
음악    60
체육    90
dtype: int64

In [10]:
seriesData[0] = 80
print(seriesData['미술'], seriesData[0])

80 80

In [15]:
# D 인덱스를 지정해줘으면 숫자로 삭제 불가
del seriesData[1]

In [16]:
seriesData

0    70
2    90
dtype: int64

In [17]:
# pandas의 데이터 타입 1. object(혼용 데이터 타입 또는 str), 2. int 3. float
#4. bool, 5. 시계열 데이터(datetime64, timedelta(두 datetime간의 차이를 ns로 나눠 계산한 값))
seriesData = pd.Series([1, 1, 1])
seriesData

0    1
1    1
2    1
dtype: int64

In [19]:
seriesData.astype('float')

0    1.0
1    1.0
2    1.0
dtype: float64

In [20]:
# Dataframe
# C
df = pd.DataFrame({
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.5, 0.45],
    "중국": [10, 13, 15]    
})
df

    미국    한국  중국
0  2.1  0.40  10
1  2.2  0.50  13
2  2.3  0.45  15

In [21]:
df = pd.DataFrame({
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.5, 0.45],
    "중국": [10, 13, 15]    
}, index=[2000, 2001, 2002])
df

       미국    한국  중국
2000  2.1  0.40  10
2001  2.2  0.50  13
2002  2.3  0.45  15

In [22]:
# R U
df.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [23]:
df.index = [2001, 2002, 2003]

In [24]:
df

       미국    한국  중국
2001  2.1  0.40  10
2002  2.2  0.50  13
2003  2.3  0.45  15

In [25]:
df.columns

Index(['미국', '한국', '중국'], dtype='object')

In [26]:
df.columns = ["일본", "필리핀", "하와이"]
df

       일본   필리핀  하와이
2001  2.1  0.40   10
2002  2.2  0.50   13
2003  2.3  0.45   15

In [28]:
df.values

array([[ 2.1 ,  0.4 , 10.  ],
       [ 2.2 ,  0.5 , 13.  ],
       [ 2.3 ,  0.45, 15.  ]])

In [30]:
df = pd.DataFrame({
    "년도": [2000, 2001, 2002],
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.5, 0.45],
    "중국": [10, 13, 15]    
})
df

     년도   미국    한국  중국
0  2000  2.1  0.40  10
1  2001  2.2  0.50  13
2  2002  2.3  0.45  15

In [37]:
df = df.set_index('년도')
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2001  2.2  0.50  13
2002  2.3  0.45  15

In [43]:
df = df.reset_index('년도')
df

     년도   미국    한국  중국
0  2000  2.1  0.40  10
1  2001  2.2  0.50  13
2  2002  2.3  0.45  15

In [44]:
df = df.set_index('년도')
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2001  2.2  0.50  13
2002  2.3  0.45  15

In [56]:
# 행가져오기 loc 인덱스 통해서, iloc 인덱스 번호 통해서
df.loc[2000] #타입 행이라도 series로 나온다

미국     2.1
한국     0.4
중국    10.0
Name: 2000, dtype: float64

In [53]:
df.iloc[2]

미국     2.30
한국     0.45
중국    15.00
Name: 2002, dtype: float64

In [57]:
#열 가져오가
df['미국']

년도
2000    2.1
2001    2.2
2002    2.3
Name: 미국, dtype: float64

In [58]:
df['미국'][2000]

2.1

In [59]:
df.loc[2000]['미국']

2.1